
# --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- ---
# 仮想ブロック左クリックイベント
# --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- ---
# 左クリックされたinteracitonにタグづけ
tag @e[tag=detection,nbt={attack:{}},limit=1] add l_click
# 左クリックされた仮想ブロックを削除
execute as @e[tag=l_click,limit=1] run function vbu:gulliver_vb/del_vb

# 仮想ブロックの削除が終了したのでフラグを削除
tag @e[tag=detection,tag=l_click] remove l_click
# --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- ---
# 進捗リセット
# --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- ---
advancement revoke @a only vbu:click_vb/left_click
