
# --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- ---
# 仮想ブロック左クリックイベント
# --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- ---
# 左クリックされたinteracitonにタグづけ
tag @e[tag=core,nbt={attack:{}},limit=1] add l_click
# 左クリックされた仮想ブロックを削除
execute as @e[tag=core,tag=l_click,limit=1] run function vbu:gulliver_vb/del_vb

# --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- ---
# 進捗リセット
# --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- ---
advancement revoke @a only vbu:click_vb/left_click_core
